{"data":{"site":{"siteMetadata":{"title":"Local.com.pk Blog","author":"Jabran Rafique"}},"markdownRemark":{"id":"e1c5229b-819b-55a0-b91d-b283c465c9f9","excerpt":"![] A week into the  announcement , I realised that I have already created some debt for myself. I am calling it time debt as it is taking much of my time. I…","html":"<p>![]</p>\n<p>A week into the <a href=\"https://localpk.github.io/blog/building-information-platform/\">announcement</a>, I realised that I have already created some debt for myself. I am calling it time debt as it is taking much of my time.</p>\n<p>I created few public channels for open discussions about the project only to realize that they would start to take more time than letting me focus on the actual project.</p>\n<p>In retrospect, I have removed all those channels now that included a <a href=\"https://www.twitter.com/localcompk\">Twitter handle</a> and a <a href=\"https://www.facebook.com/groups/643030409449705\">Facebook group</a>. However, I am going to keep the long-standing <a href=\"https://www.facebook.com/localpakistan\">Facebook Page</a> – the only place to keep up with project updates.</p>\n<p>There was also an intent of keeping everything organised in this project. I think I went a bit extreme there too by dividing the project into parts on <a href=\"https://www.github.com/localpk\">GitHub organisation</a>. Therefore retracting the overdone part and keeping main project together in one place makes sense. The content still live in their own repository and remain independent of the application.</p>\n<p>Hoping that at least, this won’t derail me from the main focus and I continue to work on adding more content for the launch. I am available on <a href=\"https://www.twitter.com/jabranr\">Twitter (@jabranr)</a> for any discussions in this regard.</p>","frontmatter":{"title":"Eliminating distractions","date":"January 31, 2019"}}},"pageContext":{"slug":"/eliminating-distractions/","previous":{"fields":{"slug":"/building-information-platform/"},"frontmatter":{"title":"Building an information platform"}},"next":null}}